In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\pythonds\skilldatascience\dsenv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in e:\pythonds\skilldatascience\dsenv\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\pythonds\skilldatascience\dsenv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\pythonds\skilldatascience\dsenv\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in e:\pythonds\skilldatascience\dsenv\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in e:\pythonds\skilldatascience\dsenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.2 -> 25.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'2.2.3'

In [ ]:
df =pd.read_csv("Titanic_data_csv", header =0)

## Datatype of Pandas

1. DataFrame : 2D Table with rows and columns
2. Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

## Creating DataFrame

In [5]:
data = {
    "name" : ["bob", "charlie", "aman"],
    "age" : [25,30,35]
}
data

{'name': ['bob', 'charlie', 'aman'], 'age': [25, 30, 35]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

      name  age
0      bob   25
1  charlie   30
2     aman   35

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
arr_data = np.array(
    [
        ["bob", 25],
        ["charlie", 30],
        ["aman" , 35]
    ]
)

In [11]:
pd.DataFrame(arr_data, columns =["Name", "age"])

      Name age
0      bob  25
1  charlie  30
2     aman  35

## Reading Data From Files

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [12]:
df = pd.read_csv("Titanic_data.csv", header =0)

In [13]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df.shape

(891, 12)

In [15]:
type(df)

pandas.core.frame.DataFrame

- `pd.read_json(file_path, delimiter=',')`: Reads Json file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [16]:
j_df = pd.read_json("data.json")

ValueError: Expected object or value

In [17]:
j_df.head()

NameError: name 'j_df' is not defined

## Accessing Data

In [18]:
name = df["Name"]

In [19]:
name.head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [20]:
type(name)

pandas.core.series.Series

In [21]:
name_age = df[["Name", "Age"]]

In [22]:
name_age

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [23]:
name_age.shape

(891, 2)

In [25]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')